zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_adcmic.h
/***************************************************************************//**
* \file cy_adcmic.h
* \version 1.10.1
*
* Provides an API declaration of the ADCMic driver.
*
********************************************************************************
* \copyright
* (c) 2022-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_adcmic
* \{
* ADCMic driver is used to process analog and digital microphone signal and 
* DC signal with the mxs40adcmic IP. This IP interfaces with Delta-Sigma modulator part 
* of the s40adcmic and implements CIC, decimation (FIR) and biquad filters.
* The ADC result is read by the CPU or the DMA from the FIFO of mxs40adcmic 
* (and from CIC register for DC measurement). Instead of taking modulator data
* from s40adcmic, mxs40adcmic can also be configured to take PDM input
* directly from an external digital microphone.
*
* \image html ADCMicBlockDiagram.png
*
* Consult the datasheet of your device for details of the
* clocking system.
*
* The high level features of the subsystem are:
*   - Analog (MIC) and digital (PDM) microphones support.
*   - Sample rate 8/16 ksps for audio (MIC and PDM modes).
*   - Configurable biquad filter for custom audio equalization.
*   - Selectable DC measurement range.
*   - Interrupt & trigger generation.
*   - Built-in FIFO buffer (for audio only).
*
* \section group_adcmic_usage Usage
*
* The high level steps to use this driver are:
*
*   -# \ref group_adcmic_initialization
*   -# \ref group_adcmic_clock
*   -# \ref group_adcmic_trigger
*   -# \ref group_adcmic_timer
*   -# \ref group_adcmic_interrupt
*   -# \ref group_adcmic_dc_measurement
*   -# \ref group_adcmic_fifo
*
* \section group_adcmic_initialization Initialization and Enabling
*
* To configure the ADCMic subsystem call \ref Cy_ADCMic_Init.
* Pass in a pointer to the \ref MXS40ADCMIC_Type structure for the base hardware register address, 
* pass in the configuration structure \ref cy_stc_adcmic_config_t, and
* pass in the operation mode.
*
* After initialization, call \ref Cy_ADCMic_Enable to enable the block.
*
* The configuration can be defined as follows:
* \snippet adcmic_snippet/snippet.c SNIPPET_ADCMIC_CFG
*
* \subsection group_adcmic_mic Analog Microphone (MIC) Mode
*
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_MIC_OP
*
* Usually the MIC mode is used with FIFO, see \ref group_adcmic_fifo
*
* \subsection group_adcmic_pdm Digital Microphone (PDM) Mode
*
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_PDM_OP
*
* Usually the MIC mode is used with FIFO, see \ref group_adcmic_fifo
*
* \subsection group_adcmic_dc DC Measurement (DC) Mode
*
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_DC_OP
*
* \subsection group_adcmic_biquad Biquad filter Initialization
*
* The biquad filter usually is used to the audio stream equalization (in MIC or PDM modes):
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_BIQUAD
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_BIQUAD_INIT
*
* \section group_adcmic_clock Clocks
*
* The ADCMic requires two input clocks: 
* - clk_sys - recommended frequency is 96MHz, input for the \ref group_adcmic_timer, usually is routed from one of the \ref group_sysclk_clk_hf
* - clk_hf - recommended frequency is 24MHz, the audio (MIC and PDM modes) reference clock, usually is routed from one of the \ref group_sysclk_clk_hf
* 
* For more exact information on the ADCMic clock routing, refer to the datasheet for your device.
*
* \section group_adcmic_trigger Triggering
*
* The ADCMic subsystem has two output triggers: from the timer and from the FIFO,
* the timer generates trigger always if enabled, the FIFO trigger could be 
* configured separately for MIC and PDM modes by the \ref cy_stc_adcmic_mic_config_t::fifoTrigger and
* \ref cy_stc_adcmic_pdm_config_t::fifoTrigger respectively.
*
* Also, they could be routed to any periphery using \ref group_trigmux driver, e.g. to DW block:
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_TRIGGER
*
* \section group_adcmic_timer Timer
*
* The Timer is used for DC measurement for two purposes:
* - generate periodic events based on ADCMic clk_sys clock.
* - count the CIC data update events.
* 
* The timer period and input signal source are configured by the \ref cy_stc_adcmic_dc_config_t::timerPeriod and
* \ref cy_stc_adcmic_dc_config_t::timerInput fields correspondingly.
*
* \section group_adcmic_interrupt Handling Interrupts
*
* The ADCMic subsystem has two interrupt sources: the timer and the FIFO.
* The FIFO interrupt can have several reasons, see \ref group_adcmic_macros_fifo_status
*
* The ADCMic interrupt to the NVIC is raised any time the intersection (logic and) of the interrupt
* flags and the corresponding interrupt masks are non-zero.
*
* Implement an interrupt routine and assign it to the ADCMic interrupt.
* Use the pre-defined enumeration, adcmic_interrupt_adcmic_IRQn, as the interrupt source for the ADCMic.
*
* The following code snippet demonstrates how to implement a routine to handle the interrupt.
* The routine gets called when any one of the ADCMic interrupts are triggered.
* When servicing an interrupt, the user must clear the interrupt so that subsequent
* interrupts can be handled.
*
* The following code snippet demonstrates how to configure and enable the interrupt.
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_ISR
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_CONFIG_INTR
*
* Alternately, instead of handling the interrupts, the \ref Cy_ADCMic_IsEndConversion function
* allows for firmware polling of the end of DC conversion status.
*
* \section group_adcmic_fifo FIFO Usage
* The ADCMic subsystem in the MIC and PDM modes stores the audio data into the FIFO.
* It can be configured separately for the MIC and PDM modes using 
* \ref cy_stc_adcmic_mic_config_t::fifoFull,
* \ref cy_stc_adcmic_mic_config_t::fifoEmpty and
* \ref cy_stc_adcmic_pdm_config_t::fifoFull,
* \ref cy_stc_adcmic_pdm_config_t::fifoEmpty
* respectively and served either by ISR:
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_ISR
* Or by DMA:
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_TRIGGER
*
* \section group_adcmic_dc_measurement DC Voltage Measurement Accuracy
*
* * The Offset is practically a raw count of the measured Ground voltage.
* * The Gain is essentially an amount of raw counts per 1 Volt of input voltage. 
*   It depends on the DC measurement range \ref cy_en_adcmic_dc_range_t.
* 
* The default Offset \ref CY_ADCMIC_DC_OFFSET and 
* Gain for both ranges \ref CY_ADCMIC_DC_1_8_GAIN and \ref CY_ADCMIC_DC_3_6_GAIN are precalculated
* based on the theory of the ADCMic operation \ref group_adcmic_macros_dc_measurement.
*
* So basically the raw count retrieved using \ref Cy_ADCMic_GetDcResult for the desired DC input
* can be directly feed into any of the \ref Cy_ADCMic_CountsTo_Volts, \ref Cy_ADCMic_CountsTo_mVolts,
* or \ref Cy_ADCMic_CountsTo_uVolts functions and have for some extend accurate result.
*
* However, to increase the accuracy the real ADCMic Gain and Offset can be defined by physically
* measuring the Reference Ground \ref CY_ADCMIC_REFGND and the Reference BandGap \ref CY_ADCMIC_BGREF.
*
* For example:
* \snippet adcmic_snippet/snippet.c SNIPPET_ADCMIC_DC_MEASURE_AVG
* \note this code snippet is not the only valid way to use this driver - it is just one possible example how it can be used.
*
* \subsection group_adcmic_dc_vbg_calib BandGap Calibration
* For further increase the measurement accuracy, the real BandGap voltage can be defined
* using external precise reference with exact known voltage:
*
* Real BandGap voltage = external reference exact voltage * (BandGap counts - GND counts) / (external reference counts - GND counts).
*
* And then use it in the Gain calculation as shown above instead of the nominal BandGap voltage \ref CY_ADCMIC_DC_VBG.
*
* \subsection group_adcmic_dc_double_sampling Correlated Double Sampling
* To further improve the DC measurement accuracy, the low frequency Noise could be dynamically
* removed by performing two measurements for each input channel sequentially:
* one measuring the desired DC input and the other one measuring the \ref CY_ADCMIC_REFGND.
* The second measurement of the\ref CY_ADCMIC_REFGND contains only the low frequency Noise (Flick Noise) information.
* It is important to perform these two measurements one after another as close as possible.
* The final true ADC output value is then obtained by subtracting the ADC output of the
* second measurement from the ADC output of the first measurement.
*
* For example:
* \snippet adcmic_snippet/snippet.c SNIPPET_ADCMIC_DC_MEASURE_DS
* \note this code snippet is not the only valid way to use this driver - it is just one possible example how it can be used.
*
* \section group_adcmic_more_information More Information
* For more information on the ADCMic ADC subsystem, refer to the datasheet of your device.
*
* \section group_adcmic_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.10.1</td>
*     <td>Updated driver documentation text.</td>
*     <td>Documentation update.</td>
*   </tr>
*   <tr>
*     <td>1.10</td>
*     <td>The ADCMic PDL driver ID \ref CY_ADCMIC_ID is updated</td>
*     <td>Avoiding possible driver ID collisions</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>
*       The cy_en_adcmic_source_t is renamed to \ref cy_en_adcmic_mode_t.<br>
*       The CY_ADCMIC_480KSPS item is removed from the \ref cy_en_adcmic_sample_rate_t.<br>
*       The cy_en_adcmic_dc_conv_time_t is removed.<br>
*       The cy_stc_adcmic_fifo_config_t is removed.<br>
*       The cy_en_adcmic_dc_result_latch_mode_t is removed.<br>
*       The cy_stc_adcmic_audio_analog_path_config_t is renamed to \ref cy_stc_adcmic_mic_config_t.<br>
*       The cy_stc_adcmic_audio_digital_path_config_t is renamed to \ref cy_stc_adcmic_pdm_config_t.<br>
*       The cy_stc_adcmic_dc_path_config_t is renamed to \ref cy_stc_adcmic_dc_config_t.<br>
*
*       The micPd parameter is removed from the \ref cy_stc_adcmic_mic_config_t<br>
*       
*       The next parameters are added into \ref cy_stc_adcmic_mic_config_t :<br>
*       * \ref cy_stc_adcmic_mic_config_t::sampleRate,<br>
*       * \ref cy_stc_adcmic_mic_config_t::biQuadConfig,<br>
*       * \ref cy_stc_adcmic_mic_config_t::fifoTrigger,<br>
*       * \ref cy_stc_adcmic_mic_config_t::fifoFull,<br>
*       * \ref cy_stc_adcmic_mic_config_t::fifoEmpty.<br>
*
*       The clockDiv parameter is removed from the \ref cy_stc_adcmic_pdm_config_t<br>
* 
*       The next parameters are added into \ref cy_stc_adcmic_pdm_config_t :<br>
*       * \ref cy_stc_adcmic_pdm_config_t::sampleRate,<br>
*       * \ref cy_stc_adcmic_pdm_config_t::biQuadConfig,<br>
*       * \ref cy_stc_adcmic_pdm_config_t::fifoTrigger,<br>
*       * \ref cy_stc_adcmic_pdm_config_t::fifoFull,<br>
*       * \ref cy_stc_adcmic_pdm_config_t::fifoEmpty.<br>
*
*       The next parameters are removed from the \ref cy_stc_adcmic_dc_config_t :<br>
*       * tmrLatch,<br>
*       * time.<br>
*
*       The next parameter is renamed in the \ref cy_stc_adcmic_dc_config_t :<br>
*       * input -> \ref cy_stc_adcmic_dc_config_t::channel.<br>
*
*       The next parameters are added into \ref cy_stc_adcmic_dc_config_t :<br>
*       * \ref cy_stc_adcmic_dc_config_t::timerPeriod,<br>
*       * \ref cy_stc_adcmic_dc_config_t::timerInput,<br>
*       * \ref cy_stc_adcmic_dc_config_t::context.<br>
*
*       The next parameters are removed from the cy_stc_adcmic_config_t :<br>
*       * clockDiv,<br>
*       * source,<br>
*       * sampleRate,<br>
*       * biQuadConfig,<br>
*       * fifoConfig,<br>
*       * tmrTrgConfig.<br>
*
*       The next parameters are renamed in the cy_stc_adcmic_config_t :<br>
*       * anaConfig -> \ref cy_stc_adcmic_config_t::micConfig,<br>
*       * digConfig -> \ref cy_stc_adcmic_config_t::pdmConfig.<br>
*
*       The new parameter 'mode' is added to the \ref Cy_ADCMic_Init.<br>
*       The \ref Cy_ADCMic_Init functions if fixed to proper process the \ref cy_stc_adcmic_mic_config_t::micClamp setting.<br>
*       The Cy_ADCMic_StartConvert and Cy_ADCMic_StopConvert API functions are removed.<br>
*       The \ref Cy_ADCMic_Enable and \ref Cy_ADCMic_Disable are updated to inherit the Start/StopConvert functionality.<br>
*       The Cy_ADCMic_SleepMic and Cy_ADCMic_WakeUpMic API functions are removed.<br>
*       The \ref Cy_ADCMic_Enable and \ref Cy_ADCMic_Disable are updated to power down all the analog subsystems at disabling and power up them at enabling.<br>
*       The parameter dcChannel of the \ref Cy_ADCMic_SelectDcChannel is renamed to channel.<br>
*       The function Cy_ADCMic_SetDcConvTime is removed.<br>
*       The interface of \ref Cy_ADCMic_SetDcOffset, \ref Cy_ADCMic_SetDcGain, \ref Cy_ADCMic_CountsTo_mVolts, \ref Cy_ADCMic_CountsTo_uVolts,<br>
*       and \ref Cy_ADCMic_CountsTo_Volts functions is changed: the 'base' parameters are removed, and the 'context' parameters are added.<br>
*       The documentation is enhanced with code snippets: \ref group_adcmic_dc_measurement, \ref group_adcmic_dc_double_sampling.
*     </td>
*     <td>Usability review</td>
*   </tr>
*   <tr>
*     <td>0.1</td>
*     <td>This is a pre-production driver release. The driver is not recommended for production use, unless the functionality is delivered in Infineon-provided applications.</td>
*     <td>Pre-production support of the CAT1B Devices</td>
*   </tr>
* </table>
*
* \defgroup group_adcmic_macros Macros
* \{
*   \defgroup group_adcmic_macros_interrupt        Interrupt Masks
*   \defgroup group_adcmic_macros_triggers         Triggers
*   \defgroup group_adcmic_macros_reg_pointers     Register Pointers
*   \defgroup group_adcmic_macros_fifo_status      FIFO Status Masks
*   \defgroup group_adcmic_macros_fifo_samples     FIFO Samples definitions
*   \defgroup group_adcmic_macros_dc_measurement   DC measurement definitions
* \}
* \defgroup group_adcmic_enums Enumerated Types
* \defgroup group_adcmic_data_structures Data Structures
* \defgroup group_adcmic_functions Functions
* \{
*   \defgroup group_adcmic_functions_basic         Initialization and Basic Functions
*   \defgroup group_adcmic_functions_interrupt     Interrupt Functions
*   \defgroup group_adcmic_functions_fifo          FIFO Functions
*   \defgroup group_adcmic_functions_dc            DC Measurement Functions
*   \defgroup group_adcmic_functions_timer         Timer Functions
*   \defgroup group_adcmic_functions_mic           Analog Microphone (MIC) Functions
* \}
*/

#if !defined (CY_ADCMIC_H)
#define CY_ADCMIC_H

#include "cy_device_headers.h"

