zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_adcmic.h
/** The sample rate for MIC and PDM modes */
typedef enum
{
    CY_ADCMIC_8KSPS,  /**< 8 ksps, for microphone only */
    CY_ADCMIC_16KSPS  /**< 16 ksps, for microphone only */
} cy_en_adcmic_sample_rate_t;

/** The DC channel
 * \note Some options may be unavailable on particular devices. 
 */
typedef enum
{
    CY_ADCMIC_REFGND = 0x0FU, /**< ADC reference ground */
    CY_ADCMIC_BGREF  = 0x0EU, /**< ADC BG REF */
    CY_ADCMIC_VDDC   = 0x0DU, /**< Core supply */
    CY_ADCMIC_VDDIO  = 0x0CU, /**< Battery/IO supply */
    CY_ADCMIC_GPIO7  = 0x17U, /**< GPIO 7  */
    CY_ADCMIC_GPIO6  = 0x16U, /**< GPIO 6  */
    CY_ADCMIC_GPIO5  = 0x15U, /**< GPIO 5  */
    CY_ADCMIC_GPIO4  = 0x14U, /**< GPIO 4  */
    CY_ADCMIC_GPIO3  = 0x13U, /**< GPIO 3  */
    CY_ADCMIC_GPIO2  = 0x12U, /**< GPIO 2  */
    CY_ADCMIC_GPIO1  = 0x11U, /**< GPIO 1  */
    CY_ADCMIC_GPIO0  = 0x10U  /**< GPIO 0  */
} cy_en_adcmic_dc_channel_t;

/** Definitions for the return mode used in \ref Cy_ADCMic_IsEndConversion */
typedef enum
{
    CY_ADCMIC_RETURN_STATUS      = 0U,    /**< Immediately returns the conversion status. */
    CY_ADCMIC_WAIT_FOR_RESULT    = 1U     /**< Does not return a result until the conversion is complete. This mode is blocking. */
} cy_en_adcmic_return_mode_t;


/** Definitions for the microphone bias settings */
typedef enum
{
    CY_ADCMIC_BIAS_1_12_REF      = 0U,    /**< 1.12 X Reference Voltage */
    CY_ADCMIC_BIAS_1_14_REF      = 1U,    /**< 1.14 X Reference Voltage */
    CY_ADCMIC_BIAS_1_17_REF      = 2U,    /**< 1.12 X Reference Voltage */
    CY_ADCMIC_BIAS_1_10_REF      = 3U     /**< 1.10 X Reference Voltage */
} cy_en_adcmic_bias_t;

/** Definitions for the PGA input common mode settings */
typedef enum
{
    CY_ADCMIC_INCM_0_4           = 0U,    /**< 0.4 X aVdd */
    CY_ADCMIC_INCM_0_45          = 1U,    /**< 0.45 X aVdd */
    CY_ADCMIC_INCM_0_35          = 2U     /**< 0.35 X aVdd */
} cy_en_adcmic_pga_incm_t;

/** Definitions for the PGA input common mode settings */
typedef enum
{
    CY_ADCMIC_OUTCM_0_6          = 0U,    /**< 0.6 */
    CY_ADCMIC_OUTCM_0_7          = 1U,    /**< 0.7 */
    CY_ADCMIC_OUTCM_0_5          = 2U     /**< 0.5 */
} cy_en_adcmic_pga_outcm_t;


/** Definitions for the DC input range settings */
typedef enum
{
    CY_ADCMIC_DC_RANGE_3_6V      = 0U,    /**< DC range 0..3.6V */
    CY_ADCMIC_DC_RANGE_1_8V      = 1U     /**< DC range 0..1.8V */
} cy_en_adcmic_dc_range_t;

/** Definitions for the timer count input settings */
typedef enum
{
    CY_ADCMIC_TIMER_COUNT_INPUT_CIC_UPDATE = 0U, /**< Counts when CIC is updated */
    CY_ADCMIC_TIMER_COUNT_INPUT_CLK_SYS    = 1U  /**< Counts up every clk_sys cycle */
} cy_en_adcmic_timer_count_input_t;

/** \} group_adcmic_enums */

/** \addtogroup group_adcmic_data_structures
* \{
*/

/** The biquad filter configuration structure */
typedef struct
{
    uint16_t bq0_num1_coeff; /**< The numerator 1 for biquad filter stage 0 */
    uint16_t bq0_num2_coeff; /**< The numerator 2 for biquad filter stage 0 */
    uint16_t bq0_num3_coeff; /**< The numerator 3 for biquad filter stage 0 */
    uint16_t bq0_den2_coeff; /**< The denominator 2 for biquad filter stage 0 */
    uint16_t bq0_den3_coeff; /**< The denominator 3 for biquad filter stage 0 */
    uint16_t bq1_num1_coeff; /**< The numerator 1 for biquad filter stage 1 */
    uint16_t bq1_num2_coeff; /**< The numerator 2 for biquad filter stage 1 */
    uint16_t bq1_num3_coeff; /**< The numerator 3 for biquad filter stage 1 */
    uint16_t bq1_den2_coeff; /**< The denominator 2 for biquad filter stage 1 */
    uint16_t bq1_den3_coeff; /**< The denominator 3 for biquad filter stage 1 */
    uint16_t bq2_num1_coeff; /**< The numerator 1 for biquad filter stage 2 */
    uint16_t bq2_num2_coeff; /**< The numerator 2 for biquad filter stage 2 */
    uint16_t bq2_num3_coeff; /**< The numerator 3 for biquad filter stage 2 */
    uint16_t bq2_den2_coeff; /**< The denominator 2 for biquad filter stage 2 */
    uint16_t bq2_den3_coeff; /**< The denominator 3 for biquad filter stage 2 */
    uint16_t bq3_num1_coeff; /**< The numerator 1 for biquad filter stage 3 */
    uint16_t bq3_num2_coeff; /**< The numerator 2 for biquad filter stage 3 */
    uint16_t bq3_num3_coeff; /**< The numerator 3 for biquad filter stage 3 */
    uint16_t bq3_den2_coeff; /**< The denominator 2 for biquad filter stage 3 */
    uint16_t bq3_den3_coeff; /**< The denominator 3 for biquad filter stage 3 */
    uint16_t bq4_num1_coeff; /**< The numerator 1 for biquad filter stage 4 */
    uint16_t bq4_num2_coeff; /**< The numerator 2 for biquad filter stage 4 */
    uint16_t bq4_num3_coeff; /**< The numerator 3 for biquad filter stage 4 */
    uint16_t bq4_den2_coeff; /**< The denominator 2 for biquad filter stage 4 */
    uint16_t bq4_den3_coeff; /**< The denominator 3 for biquad filter stage 4 */
} cy_stc_adcmic_biquad_config_t;

/** The analog microphone configuration structure */
typedef struct
{
    cy_en_adcmic_sample_rate_t        sampleRate; /**< Sample rate */
    cy_en_adcmic_bias_t                  micBias; /**< MIC bias selection */
    bool                               micBiasLz; /**< MIC bias output impedance during power down: false - hight Z, true - low Z */
    bool                                micClamp; /**< Enable MIC PGA clamping */
    cy_en_adcmic_pga_gain_t              pgaGain; /**< PGA gain 0...42 dB */
    cy_en_adcmic_pga_incm_t              pgaInCm; /**< PGA input common mode voltage selection */
    cy_en_adcmic_pga_outcm_t            pgaOutCm; /**< PGA output common mode voltage selection */
    cy_stc_adcmic_biquad_config_t * biQuadConfig; /**< The pointer to the biquad filter configuration structure */
    bool                             fifoTrigger; /**< Trigger out on valid FIFO data */
    uint8_t                             fifoFull; /**< Count for FIFO full condition */
    uint8_t                            fifoEmpty; /**< Count for FIFO empty condition */
} cy_stc_adcmic_mic_config_t;

/** The PDM path configuration structure */
typedef struct
{
    cy_en_adcmic_sample_rate_t        sampleRate; /**< Sample rate */
    bool                                clockInv; /**< Inverts the clock */
    uint8_t                           latchDelay; /**< the PDM data latch delay,
                                                   *   when clockInv is false, the valid range is 1...8
                                                   *   when clockInv is true, the valid range is 2...9
                                                   */
    cy_stc_adcmic_biquad_config_t * biQuadConfig; /**< The pointer to the biquad filter configuration structure */
    bool                             fifoTrigger; /**< Trigger out on valid FIFO data */
    uint8_t                             fifoFull; /**< Count for FIFO full condition */
    uint8_t                            fifoEmpty; /**< Count for FIFO empty condition */
} cy_stc_adcmic_pdm_config_t;

/** The ADCMic driver context structure - it stores the gain and offset values for DC voltage measurement. */
typedef struct
{
    int16_t offset; /**< The storage for the offset calibration value */
    int16_t gain;   /**< The storage for the gain calibration value */
} cy_stc_adcmic_context_t;

/** The DC measurement path configuration structure */
typedef struct
{
    cy_en_adcmic_dc_range_t               range; /**< Selects the DC measurement range */
    cy_en_adcmic_dc_channel_t           channel; /**< DC channel to be measured */
    uint16_t                        timerPeriod; /**< Timer period */
    cy_en_adcmic_timer_count_input_t timerInput; /**< Timer count input */
    cy_stc_adcmic_context_t           * context; /**< The pointer to the context structure.
                                                  *   If none of the \ref Cy_ADCMic_CountsTo_uVolts,
                                                  *                  \ref Cy_ADCMic_CountsTo_mVolts,
                                                  *              nor \ref Cy_ADCMic_CountsTo_Volts
                                                  *   functions is used, this pointer can be NULL.
                                                  */
} cy_stc_adcmic_dc_config_t;

/** The ADCMic driver configuration structure. */
typedef struct
{
    cy_stc_adcmic_mic_config_t * micConfig; /**< The pointer to the audio analog path configuration structure */
    cy_stc_adcmic_pdm_config_t * pdmConfig; /**< The pointer to the audio digital path configuration structure */
    cy_stc_adcmic_dc_config_t  * dcConfig;  /**< The pointer to the DC measurement path configuration structure */
} cy_stc_adcmic_config_t;

/** \} group_adcmic_data_structures */

/** \addtogroup group_adcmic_functions
* \{
*/

/** \addtogroup group_adcmic_functions_basic
* This set of functions is for initialization and basic usage
* \{
*/

