zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_adcmic.h
/*******************************************************************************
* Function Name: Cy_ADCMic_Init
****************************************************************************//**
*
* Initializes the ADCMic block from a pre-initialized configuration structure.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param config
* The pointer to the configuration structure \ref cy_stc_adcmic_config_t.
*
* \param mode
* The ADCMic operation mode /ref cy_en_adcmic_mode_t.
*
* \return
* The status \ref cy_en_adcmic_status_t.
*
* \funcusage
* \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_MIC_OP
*
*******************************************************************************/
cy_en_adcmic_status_t Cy_ADCMic_Init(MXS40ADCMIC_Type * base, cy_stc_adcmic_config_t const * config, cy_en_adcmic_mode_t mode);


/*******************************************************************************
* Function Name: Cy_ADCMic_InitBiquad
****************************************************************************//**
*
* Initializes the biquad filter coefficients.
* Usually is called from the \ref Cy_ADCMic_Init.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param biQuadConfig
* The pointer to the biquad filter configuration structure \ref cy_stc_adcmic_biquad_config_t.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_BIQUAD_INIT
*
*******************************************************************************/
void Cy_ADCMic_InitBiquad(MXS40ADCMIC_Type * base, cy_stc_adcmic_biquad_config_t const * biQuadConfig);


/*******************************************************************************
* Function Name: Cy_ADCMic_BiquadBypass
****************************************************************************//**
*
* Bypasses/unbypasses the biquad filter.
* Usually is called from the \ref Cy_ADCMic_Init.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param bypass
* The boolean specifier to bypass(true) or unbypass(false) the biquad filter.
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_BiquadBypass(MXS40ADCMIC_Type * base, bool bypass)
{
    CY_REG32_CLR_SET(base->AUXADC_CTRL, MXS40ADCMIC_AUXADC_CTRL_BIQUAD_BYPASS, (bypass) ? 1UL : 0UL);
}


/*******************************************************************************
* Function Name: Cy_ADCMic_Enable
****************************************************************************//**
*
* Enables the ADCMic block operation.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_MIC_OP
*
*******************************************************************************/
void Cy_ADCMic_Enable(MXS40ADCMIC_Type * base);


/*******************************************************************************
* Function Name: Cy_ADCMic_Disable
****************************************************************************//**
*
* Disables the ADCMic block operation.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_STOP
*
*******************************************************************************/
void Cy_ADCMic_Disable(MXS40ADCMIC_Type * base);


/*******************************************************************************
* Function Name: Cy_ADCMic_SetSampleRate
****************************************************************************//**
*
* Sets the specified ADC sample rate. Applicable for MIC/PDM modes only.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param sampleRate
* The source value \ref cy_en_adcmic_sample_rate_t.
*
* \return
* The status \ref cy_en_adcmic_status_t.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_MIC_OP
*
*******************************************************************************/
cy_en_adcmic_status_t Cy_ADCMic_SetSampleRate(MXS40ADCMIC_Type * base, cy_en_adcmic_sample_rate_t sampleRate);


/*******************************************************************************
* Function Name: Cy_ADCMic_ClearTrigger
****************************************************************************//**
*
* Clears the specified trigger signal.
*
* \param base
* The pointer to the hardware ADC block.
*
* \param trigMask
* The mask of triggers to clear.
* Select one or more masks from \ref group_adcmic_macros_triggers and "OR" them together:
* - \ref CY_ADCMIC_TRIG_DC
* - \ref CY_ADCMIC_TRIG_DATA
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_ClearTrigger(MXS40ADCMIC_Type * base, uint32_t trigMask)
{
    base->ADCMIC_TRIGGER_CLR = trigMask & CY_ADCMIC_TRIG;
}
/** \} group_adcmic_functions_basic */

/** \addtogroup group_adcmic_functions_mic
* This set of functions is for analog microphone resources control
* \{
*/

/*******************************************************************************
* Function Name: Cy_ADCMic_SetPgaGain
****************************************************************************//**
*
* Configures the PGA gain (0dB to 42dB in steps of 1dB)
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param gain
* The gain value \ref cy_en_adcmic_pga_gain_t.
*
* \return
* The status \ref cy_en_adcmic_status_t.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_GAIN
*
*******************************************************************************/
cy_en_adcmic_status_t Cy_ADCMic_SetPgaGain(MXS40ADCMIC_Type * base, cy_en_adcmic_pga_gain_t gain);

/** \} group_adcmic_functions_mic */

/** \addtogroup group_adcmic_functions_timer
* This set of functions is for Timer control
* \{
*/

/*******************************************************************************
* Function Name: Cy_ADCMic_EnableTimer
****************************************************************************//**
*
* Enables the timer.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_TIMER
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_EnableTimer(MXS40ADCMIC_Type * base)
{
    base->ADCMIC_TRIG_INTRPT_TIMER_CTRL &= ~MXS40ADCMIC_ADCMIC_TRIG_INTRPT_TIMER_CTRL_TIMER_CLR_Msk;
    (void)base->ADCMIC_TRIG_INTRPT_TIMER_CTRL; /* Dummy read to ensure write is done before return */
}


