zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_adcmic.h
/*******************************************************************************
* Function Name: Cy_ADCMic_DisableTimer
****************************************************************************//**
*
* Disables the timer.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_TIMER
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_DisableTimer(MXS40ADCMIC_Type * base)
{
    base->ADCMIC_TRIG_INTRPT_TIMER_CTRL |= MXS40ADCMIC_ADCMIC_TRIG_INTRPT_TIMER_CTRL_TIMER_CLR_Msk;
    (void)base->ADCMIC_TRIG_INTRPT_TIMER_CTRL; /* Dummy read to ensure write is done before return */
}


/*******************************************************************************
* Function Name: Cy_ADCMic_SetTimerPeriod
****************************************************************************//**
*
* Sets the timer period.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param period
* The 16-bit timer period.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_TIMER
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_SetTimerPeriod(MXS40ADCMIC_Type * base, uint16_t period)
{
    CY_REG32_CLR_SET(base->ADCMIC_TRIG_INTRPT_TIMER_CTRL, MXS40ADCMIC_ADCMIC_TRIG_INTRPT_TIMER_CTRL_TIMER_LIMIT, period);
}
/** \} group_adcmic_functions_timer */

/** \addtogroup group_adcmic_functions_dc
* This set of functions is for DC measurement mode
* \{
*/

/*******************************************************************************
* Function Name: Cy_ADCMic_SelectDcChannel
****************************************************************************//**
*
* Sets the specified DC measurement channel.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param channel
* The DC measurement channel \ref cy_en_adcmic_dc_channel_t.
*
* \note This function is useful for DC measurement only.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_DC_OP
*
*******************************************************************************/
void Cy_ADCMic_SelectDcChannel(MXS40ADCMIC_Type * base, cy_en_adcmic_dc_channel_t channel);


/*******************************************************************************
* Function Name: Cy_ADCMic_IsEndConversion
****************************************************************************//**
*
* Immediately return the status of the conversion or does not return (blocking)
* until the conversion completes, depending on the retMode parameter.
* In blocking mode, there is a time out of about 10 seconds for a CPU speed of
* 100 MHz.
*
* \param base
* Pointer to structure describing registers
*
* \param retMode
* A value of the enum \ref cy_en_adcmic_return_mode_t
*
* \return
* - \ref CY_ADCMIC_SUCCESS : the last conversion is complete
* - \ref CY_ADCMIC_CONVERSION_NOT_COMPLETE : the conversion has not completed
* - \ref CY_ADCMIC_TIMEOUT : the watchdog timer has expired in blocking mode
*
* \sideeffect
* This function reads the end of conversion status interrupt bit and clears it after.
*
* \note
* \ref CY_ADCMIC_WAIT_FOR_RESULT return modes are not recommended
* for use in RTOS environment.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_DC_OP
*
*******************************************************************************/
cy_en_adcmic_status_t Cy_ADCMic_IsEndConversion (MXS40ADCMIC_Type * base, cy_en_adcmic_return_mode_t retMode);


/*******************************************************************************
* Function Name: Cy_ADCMic_GetDcResult
****************************************************************************//**
*
* Returns the DC conversion result from the CIC status register.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \return
* The signed DC conversion result.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_DC_OP
*
*******************************************************************************/
__STATIC_INLINE int16_t Cy_ADCMic_GetDcResult(MXS40ADCMIC_Type * base)
{
    return ((int16_t)((uint16_t)_FLD2VAL(MXS40ADCMIC_AUXADC_CIC_STATUS_CIC, base->AUXADC_CIC_STATUS)));
}


/*******************************************************************************
* Function Name: Cy_ADCMic_SetDcOffset
****************************************************************************//**
*
* Sets the offset value for DC measurement calibration.
*
* \param offset
* The offset value.
*
* \param context
* The pointer to the context structure \ref cy_stc_adcmic_context_t.
*
*******************************************************************************/
void Cy_ADCMic_SetDcOffset(int16_t offset, cy_stc_adcmic_context_t * context);


/*******************************************************************************
* Function Name: Cy_ADCMic_SetDcGain
****************************************************************************//**
*
* Sets the gain value for DC measurement calibration.
*
* \param gain
* The gain value.
*
* \param context
* The pointer to the context structure \ref cy_stc_adcmic_context_t.
*
*******************************************************************************/
void Cy_ADCMic_SetDcGain(int16_t gain, cy_stc_adcmic_context_t * context);


/*******************************************************************************
* Function Name: Cy_ADCMic_CountsTo_mVolts
****************************************************************************//**
*
* Convert the ADC output to millivolts as an int16. For example, if the ADC
* measured 0.534 volts, the return value would be 534.
* The calculation of voltage depends on the DC range.
* The equation used is:
*
*     mV = (RawCounts - Offset) * 1000 / Gain
*
* where,
* - RawCounts: Raw counts returned by the \ref Cy_ADCMic_GetDcResult.
* - Offset - the offset value, can be adjusted by the \ref Cy_ADCMic_SetDcOffset,
*   essentially it is a raw count value of the \ref CY_ADCMIC_REFGND voltage measurement.
* - 1000 - amount of millivolts in 1 volt
* - Gain: the gain value, can be adjusted by the \ref Cy_ADCMic_SetDcGain, depends on DC range,
*   essentially it is an amount of raw counts per 1 volt of input voltage.
*
* \note
* This function is for DC measurement only.
*
* \param adcCounts
* Conversion result from \ref Cy_ADCMic_GetDcResult
*
* \param context
* The pointer to the context structure \ref cy_stc_adcmic_context_t.
*
* \return
* Result in millivolts.
*
* \funcusage \snippet adcmic_snippet/snippet.c SNIPPET_ADCMIC_DC_MEASURE
*
*******************************************************************************/
int16_t Cy_ADCMic_CountsTo_mVolts(int16_t adcCounts, cy_stc_adcmic_context_t const * context);


