zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_adcmic.h
/*******************************************************************************
* Function Name: Cy_ADCMic_CountsTo_uVolts
****************************************************************************//**
*
* Convert the ADC output to microvolts as an int32. For example, if the ADC
* measured 0.534 volts, the return value would be 534000.
* The calculation of voltage depends on the DC range.
* The equation used is:
*
*     uV = (RawCounts - Offset) * 1000000 / Gain
*
* where,
* - RawCounts: Raw counts returned by the \ref Cy_ADCMic_GetDcResult.
* - Offset - the offset value, can be adjusted by the \ref Cy_ADCMic_SetDcOffset,
*   essentially it is a raw count value of the \ref CY_ADCMIC_REFGND voltage measurement.
* - 1000000 - amount of microvolts in 1 volt
* - Gain: the gain value, can be adjusted by the \ref Cy_ADCMic_SetDcGain, depends on DC range,
*   essentially it is an amount of raw counts per 1 volt of input voltage.
*
* \note
* This function is for DC measurement only.
*
* \param adcCounts
* Conversion result from \ref Cy_ADCMic_GetDcResult
*
* \param context
* The pointer to the context structure \ref cy_stc_adcmic_context_t.
*
* \return
* Result in microvolts.
*
* \funcusage \snippet adcmic_snippet/snippet.c SNIPPET_ADCMIC_DC_MEASURE
*
*******************************************************************************/
int32_t Cy_ADCMic_CountsTo_uVolts(int16_t adcCounts, cy_stc_adcmic_context_t const * context);


/*******************************************************************************
* Function Name: Cy_ADCMic_CountsTo_Volts
****************************************************************************//**
*
* Convert the ADC output to volts as a float. For example, if the ADC
* measured 0.534 volts, the return value would be 0.534.
* The calculation of voltage depends on the DC range.
* The equation used is:
*
*     V = (RawCounts - Offset) / Gain
*
* where,
* - RawCounts: Raw counts returned by the \ref Cy_ADCMic_GetDcResult.
* - Offset - the offset value, can be adjusted by the \ref Cy_ADCMic_SetDcOffset,
*   essentially it is a raw count value of the \ref CY_ADCMIC_REFGND voltage measurement.
* - Gain: the gain value, can be adjusted by the \ref Cy_ADCMic_SetDcGain, depends on DC range,
*   essentially it is an amount of raw counts per 1 volt of input voltage.
*
* \note
* This function is for DC measurement only.
*
* \param adcCounts
* Conversion result from \ref Cy_ADCMic_GetDcResult
*
* \param context
* The pointer to the context structure \ref cy_stc_adcmic_context_t.
*
* \return
* Result in volts.
*
* \funcusage \snippet adcmic_snippet/snippet.c SNIPPET_ADCMIC_DC_MEASURE
*
*******************************************************************************/
float Cy_ADCMic_CountsTo_Volts(int16_t adcCounts, cy_stc_adcmic_context_t const * context);
/** \} group_adcmic_functions_dc */

/** \addtogroup group_adcmic_functions_interrupt
* This set of functions are related to ADCMic interrupts.
* \{
*/

/*******************************************************************************
* Function Name: Cy_ADCMic_EnableInterrupt
****************************************************************************//**
*
* Sets the specified interrupt bit in the interrupt mask register.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param intrMask
* The mask of interrupts to enable.
* Select one or more values from \ref group_adcmic_macros_interrupt and "OR" them together.
* - \ref CY_ADCMIC_INTR_DC
* - \ref CY_ADCMIC_INTR_DATA
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_CONFIG_INTR
*
*******************************************************************************/
void Cy_ADCMic_EnableInterrupt(MXS40ADCMIC_Type * base, uint32_t intrMask);


/*******************************************************************************
* Function Name: Cy_ADCMic_DisableInterrupt
****************************************************************************//**
*
* Clears the specified interrupt bit in the interrupt mask register.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param intrMask
* The mask of interrupts to disable.
* Select one or more values from \ref group_adcmic_macros_interrupt and "OR" them together.
* - \ref CY_ADCMIC_INTR_DC
* - \ref CY_ADCMIC_INTR_DATA
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_CONFIG_INTR
*
*******************************************************************************/
void Cy_ADCMic_DisableInterrupt(MXS40ADCMIC_Type * base, uint32_t intrMask);


/*******************************************************************************
* Function Name: CY_ADCMIC_GetInterruptStatus
****************************************************************************//**
*
* Returns the interrupt status of the specified channel.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \return
* The interrupt status.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_CONFIG_INTR
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_ADCMic_GetInterruptStatus(MXS40ADCMIC_Type const * base)
{
    return (base->ADCMIC_INTR & CY_ADCMIC_INTR);
}


/*******************************************************************************
* Function Name: Cy_ADCMic_ClearInterrupt
****************************************************************************//**
*
* Clears the interrupt status.
*
* \param base
* The pointer to the hardware ADC block.
*
* \param intrMask
* The mask of interrupts to clear. Typically this will be the value returned
* from \ref Cy_ADCMic_GetInterruptStatus.
* Alternately, select one or more values from \ref group_adcmic_macros_interrupt and "OR" them together.
* - \ref CY_ADCMIC_INTR_DC
* - \ref CY_ADCMIC_INTR_DATA
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_CONFIG_INTR
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_ClearInterrupt(MXS40ADCMIC_Type * base, uint32_t intrMask)
{
    base->ADCMIC_INTR = intrMask & CY_ADCMIC_INTR;
    /* This dummy reading is necessary here. It provides a guarantee that interrupt is cleared at returning from this function. */
    (void) base->ADCMIC_INTR;
}


