zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_adcmic.h
/*******************************************************************************
* Function Name: Cy_ADCMic_SetInterrupt
****************************************************************************//**
*
* Sets the interrupt for the specified channel.
* Intended mostly for debugging.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param intrMask
* The mask of interrupts to set.
* Select one or more values from \ref group_adcmic_macros_interrupt and "OR" them together.
* - \ref CY_ADCMIC_INTR_DC
* - \ref CY_ADCMIC_INTR_DATA
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_SetInterrupt(MXS40ADCMIC_Type * base, uint32_t intrMask)
{
    base->ADCMIC_INTR_SET = intrMask & CY_ADCMIC_INTR;
}


/*******************************************************************************
* Function Name: CY_ADCMIC_GetInterruptMask
****************************************************************************//**
*
* Returns the interrupt mask value of the specified channel.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \return
* The interrupt mask value.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_GET_INTERRUPT_MASK
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_ADCMic_GetInterruptMask(MXS40ADCMIC_Type const * base)
{
    return (base->ADCMIC_INTR_MASK & CY_ADCMIC_INTR);
}


/*******************************************************************************
* Function Name: CY_ADCMIC_SetInterruptMask
****************************************************************************//**
*
* Sets an interrupt mask value for the specified channel.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param intrMask
* The mask of interrupts.
* Select one or more values from \ref group_adcmic_macros_interrupt and "OR" them together.
* - \ref CY_ADCMIC_INTR_DC
* - \ref CY_ADCMIC_INTR_DATA
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_SET_INTERRUPT_MASK
*
*******************************************************************************/
__STATIC_INLINE void Cy_ADCMic_SetInterruptMask(MXS40ADCMIC_Type * base, uint32_t intrMask)
{
    base->ADCMIC_INTR_MASK = intrMask & CY_ADCMIC_INTR;
}


/*******************************************************************************
* Function Name: CY_ADCMIC_GetInterruptStatusMasked
****************************************************************************//**
*
* Returns the logical AND of the corresponding INTR and INTR_MASK fields
* in a single-load operation.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \return
* The masked interrupt status.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_CONFIG_INTR
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_ADCMic_GetInterruptStatusMasked(MXS40ADCMIC_Type const * base)
{
    return (base->ADCMIC_INTR_MASKED & CY_ADCMIC_INTR);
}
/** \} group_adcmic_functions_interrupt */

/** \addtogroup group_adcmic_functions_fifo
* This set of functions are related to ADCMic FIFO buffer.
* \{
*/

/*******************************************************************************
* Function Name: Cy_ADCMic_ReadFifoAll
****************************************************************************//**
*
* Reads whole the FIFO payload into the data array.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \param data
* The pointer to the uint16_t data array for the FIFO payload.
*
* \return
* The 8-bit FIFO data count.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_ISR
*
*******************************************************************************/
uint8_t Cy_ADCMic_ReadFifoAll(MXS40ADCMIC_Type const * base, uint16_t * data);


/*******************************************************************************
* Function Name: Cy_ADCMic_ReadFifoStatus
****************************************************************************//**
*
* Returns the fifo status.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \return
* The 8-bit fifo status, see \ref group_adcmic_macros_fifo_status.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_ADCMIC_ISR
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_ADCMic_GetFifoStatus(MXS40ADCMIC_Type const * base)
{
    return ((uint8_t)_FLD2VAL(MXS40ADCMIC_ADCMIC_FIFO_CTRL_FIFO_STATUS, base->ADCMIC_FIFO_CTRL));
}


/*******************************************************************************
* Function Name: Cy_ADCMic_ReadFifo
****************************************************************************//**
*
* Low-level API which returns the ADCMIC_DATA register value
* that contains \b two subsequent FIFO data samples.
*
* \param base
* The pointer to the hardware ADCMic block.
*
* \return
* The combined 32-bit value of two 16-bit samples.
* Use \ref group_adcmic_macros_fifo_samples to parse it.
*
* \funcusage \snippet adcmic/snippet/adcmic_snippet.c SNIPPET_READ_FIFO
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_ADCMic_ReadFifo(MXS40ADCMIC_Type const * base)
{
    return (base->ADCMIC_DATA);
}

/** \} group_adcmic_functions_fifo */

/** \} group_adcmic_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS40ADCMIC */

#endif  /* (CY_ADCMIC_H) */

/** \} group_adcmic */

/* [] END OF FILE */
